; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-6)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(free left)
(free right)
(at ball1 roomb)
(at ball2 room4)
(at ball3 room4)
(at ball4 room5)
(at ball5 room5)
(at ball6 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 6
2. (pick ball1 roomb left)
   deleted: (at ball1 roomb) (free left)
   added: (carry ball1 left)
   goals met: 2 of 6
3. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 2 of 6
4. (pick ball6 room6 right)
   deleted: (at ball6 room6) (free right)
   added: (carry ball6 right)
   goals met: 2 of 6
5. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 2 of 6
6. (drop ball6 room5 right)
   deleted: (carry ball6 right)
   added: (at ball6 room5) (free right)
   goals met: 3 of 6
7. (drop ball1 room5 left)
   deleted: (carry ball1 left)
   added: (at ball1 room5) (free left)
   goals met: 4 of 6
8. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 4 of 6
9. (pick ball3 room4 left)
   deleted: (at ball3 room4) (free left)
   added: (carry ball3 left)
   goals met: 4 of 6
10. (pick ball2 room4 right)
   deleted: (at ball2 room4) (free right)
   added: (carry ball2 right)
   goals met: 4 of 6
11. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 4 of 6
12. (drop ball3 room5 left)
   deleted: (carry ball3 left)
   added: (at ball3 room5) (free left)
   goals met: 5 of 6
13. (drop ball2 room5 right)
   deleted: (carry ball2 right)
   added: (at ball2 room5) (free right)
   goals met: 6 of 6
